Revit 2027 API
TemporaryGraphicsManager.SetTooltip Method
 Sets the tooltip for the temporary graphics object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTooltip(
	int index,
	string tooltip
)
Public Sub SetTooltip (
	index As Integer,
	tooltip As String
)
public:
void SetTooltip(
	int index,
	String^ tooltip
)
member SetTooltip :
        index : int *
        tooltip : string -> unit
Parameters
index Int32
 Unique index of the temporary graphics object to be updated.
tooltip String
 Tooltip to be set.
Exceptions
Exception | Condition
ArgumentException |  index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace